alert("Программа вычисляет значение функции y=f(x) при произвольных значениях x, вводимых пользователем.\
       Система уравнений следующая:\n\
       y = 2*cos(a*x^2-b)^2 при x<=-2,\n\
       y = 3*x^2+b при x>3,\n\
       y = sgrt(x^2 + e^(a*x)) при -2<x<=3,\n\
       где а = 1.3, b = 2.5");

const a = 1.3;
const b = 2.5;
var y;
var x = prompt("Введите значение х:", 0);

if (x <= -2) {
    y = 2*Math.cos(a*x**2 - b)**2;
} else if (x > 3) {
    y = 3*x**2 + b;
} else {
    y = Math.sqrt(x**2 + Math.E**(a*x));
}
y = Math.round(y * 100) / 100;
alert("При x = " + x + " функция y = f(x) принимает значение " + y + ".")